app/views/users/index.html.erb

SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 2]]
---
        <p class="card-text">
          <%= pluralize(user.articles.count, "article") %>