app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY "articles"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 0]]
---
  def index
    @articles = Article.all

SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "test user"], ["description", "first user article"], ["created_at", "2024-06-04 18:36:18.788241"], ["updated_at", "2024-06-04 18:36:18.788241"], ["user_id", 2]]
---
  def create
    @article = Article.new(article_params)
    @article.user = User.last

    if @article.save