app/controllers/users_controller.rb

  def destroy
    set_user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 12]]